In [1]:
import pandas as pd

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

1. Display Top 3 Rows of The Dataset

In [2]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

2. Check Last 3 Rows of The Dataset

In [3]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

3. Find Shape of Our Dataset (Number of Rows and Number of Columns)

In [4]:
df1.shape

(7, 3)

In [5]:
print("Number of Rows and Columns ", df1.shape[0],',',df1.shape[1])

Number of Rows and Columns  7 , 3

4. Get Information About ouor Dataset like Toal Number of Rows, Total Number of Columns , Datatypes of Each Column and Memory Requirement

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

5. Check Null Values In The Dataset

In [7]:
df1.isnull().sum(axis=1) # 0 = column , 1 = row

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

6. Get Overall Statistics About The Dataframe

In [8]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

7. Find Unique Values From The Gender Column

In [9]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

8. Find the Number of Unique values from the Gender Column

In [10]:
df1.iloc[:,2].nunique()

2

9. Display Count of Unique Values in Gender Column

In [11]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

10. Find Total Number of Students Having Marks Between 90 to 100 (inclusive) Using Between Method

In [12]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [13]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [14]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [15]:
len(df1[df1['Marks'].between(90,100)] )

4

In [16]:
sum(df1['Marks'].between(90,100))

4

11. Find Average Marks

In [17]:
df1['Marks'].mean()

np.float64(92.14285714285714)

12. Apply Method

In [18]:
def marks(x):
    return x/2

In [19]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [20]:
df1.loc[:,'Half Marks']=df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [23]:
df1.loc[:,'Half Marks']=df1['Marks'].apply(lambda x:x/2)

13. Map Function

In [25]:
def myfunc(x):
    if x=='Male':
        return 1
    return 0
df1.loc[:,'Male_Female']=df1['Gender'].map(myfunc)
df1

      Name  Marks  Gender  Half Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [31]:
df1.loc[:,'Male_Female']=df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

14. Drop The Column

15. Print name of the Columns

In [35]:
df1.columns

['Name', 'Marks', 'Gender', 'Half Marks', 'Male_Female']

16. Sort the Dataframe as per Mark Column

In [47]:
df1.sort_values(by='Marks')
# df1.sort_index(ascending=False,axis=1)

      Name  Marks  Gender  Half Marks  Male_Female
5   Mittal     83  Female        41.5            0
3   Vedant     87    Male        43.5            1
1   Aadhya     89  Female        44.5            0
4   Parshv     90    Male        45.0            1
0  Priyang     98    Male        49.0            1
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0

17. Sort by multiple column value

In [48]:
df1.sort_values(by=['Marks','Half Marks'])

      Name  Marks  Gender  Half Marks  Male_Female
5   Mittal     83  Female        41.5            0
3   Vedant     87    Male        43.5            1
1   Aadhya     89  Female        44.5            0
4   Parshv     90    Male        45.0            1
0  Priyang     98    Male        49.0            1
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0

18 . Display Name and Marks of Female Student

In [52]:
# df1.loc[:,['Name','Marks']]
df1[df1['Gender']=='Female'].loc[:,['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99